## 재귀함수
## 001
## 1부터 N까지의 합과 곱

# * 내가 나를 호출하는 방법
# * 반복문 <-> 재귀함수

# x = 0
# n = 100
# ************ 1부터 100까지의 합 ************
# # ******1. 반복문
# # ******      : O(n)
# for i in range(1,n+1):
#     x += i
# print(x)

# /////////// ⬇ 재귀함수로 변경 ⬇ ///////////
def f(n):
    if n <= 1:
        return 1
    else:
        return n + f(n-1)

n = 100
print(f(n))

#     # f(n)  n       return      최종
# 1.  f(100)  100     100+f(99)
# 2.  f(99)   99      99+f(98)
# 3.  f(98)   98      98+f(97)    97 + 96 + 95 + 94 + ... + 2 + 1 = 4753 (97*98//2)
# 4.  ...
# 5.  f(2)    2       2+f(1)      2+1 =3
# 6.  f(1)    1       1


# ************ 1부터 5까지의 곱 ************
# # ******1. 반복문 O(n)
# x = 1
# for i in range(1,100):
#     x *= i
# print(x)

# /////////// ⬇ 재귀함수로 변경 ⬇ ///////////
def f(n):
    if n <= 1:
        return 1
    else:
        return n * f(n-1)

n = 100
print(f(n))

#     # f(n)    n       return      최종
# 1.  f(5)      5      2 * f(1) =120
# 2.  f(4)      4      2 * f(1) =24
# 3.  f(3)      3      2 * f(1) =6
# 4.  f(2)      2      2 * f(1) =2
# 5.  f(1)      1      1
